[
    {
        "BookNumber": 1,
        "SeriesTitle": "The Shattered Epic",
        "BookTitle": "Cinders of Reverence",
        "BookWordCount": null,
        "BookSummary": "protagonists parents are executed by the church, she is orphaned and joins a church orphanage and is trained to become a church magician / inquisitor. trained by the high flame, the leader, who has found forbidden magics to fuel his life. and channel divine magic into talismans the church wields to cast magic.\r\nthe main anatagonist the prince finds out he has magic and kills his father the king when he is 16. arana attacks the leader of the Order of flame (the churchs executive) and is forced to flee \r\n",
        "BookToDo": null
    },
    {
        "BookNumber": 2,
        "SeriesTitle": "The Shattered Epic",
        "BookTitle": "Path of Oblivion",
        "BookWordCount": null,
        "BookSummary": "she and her friend Liam flee the city, chased after by Siva, the High flames most loyal servant. and go looking for the underground faction \"Shadows of dawn\" where she receives more thorough wild magic education and finds allies. \r\nThe High Flame intensifies his prosecution of wild magicians and his abominable magic practices. \r\nThe prince is posessed by a dark entity and it starts to take over. they have their first confrontation. \r\n",
        "BookToDo": null
    },
    {
        "BookNumber": 3,
        "SeriesTitle": "The Shattered Epic",
        "BookTitle": "Mirrors of Creation",
        "BookWordCount": null,
        "BookSummary": "my protagonist sets out to find more allies and secret knowledge in the bordering country \"The Rheem\", which is veiled in shadow and inaccessible, but she finds a way, and the origin of the shadows. \r\nMy protagonist learns there, that while enacting her revenge against the church is her deepest desire, it will cause the end of the world, and that her actual goal needs to be the unification of wild and divine magic. \r\nmeanwhile the prince rages a violent war against wild magicians, which bring the energies further out of balance, the world is starting to fall apart. \r\nshe can either kill the prince, which unleashes the dark entity within him, or she has the choice to sacrifice herself, and release the light entity within her, to merge with the princes dark entity and bring balance back. She does and both survive. The prince is now free from his corruption and has an awakening. together they vow to take on the church and bring unity back. \r\n",
        "BookToDo": null
    },
    {
        "BookNumber": 4,
        "SeriesTitle": "The Shattered Epic",
        "BookTitle": "Crest of Serenity",
        "BookWordCount": null,
        "BookSummary": "they set out on their quest together and confront the High flame and remove him from power or kill him. ",
        "BookToDo": null
    }
]