[
    {
        "Name": "Kingsway",
        "Type": "Road",
        "Length": 250,
        "Notes": "Connects Sovalis to the Southern Isles. One of the oldest routes, heavily used by merchants and travelers.",
        "TravelTime": "6 to 8 days by horse, 8 to 10 days by cart"
    },
    {
        "Name": "Old North Road",
        "Type": "Road",
        "Length": 600,
        "Notes": "Spans the entire country from the Northern Border near Sheen to the Southern Isles. Long and well-guarded.",
        "TravelTime": "15 to 20 days by horse, 20 to 30 days by cart"
    },
    {
        "Name": "Eastern Passage",
        "Type": "Road",
        "Length": 400,
        "Notes": "From Sovalis through the forests to the border of The Rheem. Terrain becomes mystical and unpredictable near the end.",
        "TravelTime": "10 to 15 days by horse, up to 22 days by cart"
    },
    {
        "Name": "Fjord Trail",
        "Type": "Road",
        "Length": 350,
        "Notes": "Winding path from Sovalis to the fjords that border Juve. Slightly faster travel due to better roads.",
        "TravelTime": "9 to 12 days by horse, up to 17 days by cart"
    },
    {
        "Name": "Merchant's Trail",
        "Type": "Trade Route",
        "Length": 180,
        "Notes": "Heavily trafficked by traders. Connects major marketplaces between Valor’s Reach and Haven’s Rest.",
        "TravelTime": "4 to 6 days by horse, 6 to 8 days by cart"
    },
    {
        "Name": "Moongate Lane",
        "Type": "Path",
        "Length": 75,
        "Notes": "A cobblestone path lined with ancient trees. It’s said that on moonlit nights, illusions appear along the road.",
        "TravelTime": "2 to 3 days by foot"
    },
    {
        "Name": "Crosswind Passage",
        "Type": "Mountain Path",
        "Length": 120,
        "Notes": "A dangerous trail through the Pharr Mountains. Strong winds and narrow ledges make this path risky but direct.",
        "TravelTime": "3 to 5 days by foot, unsafe for carts"
    },
    {
        "Name": "Southwatch Road",
        "Type": "Trade Road",
        "Length": 200,
        "Notes": "Leads from the southern watchtower into the coastal ports of the Southern Isles. Protected and maintained by city guards.",
        "TravelTime": "5 to 6 days by horse, 7 to 9 days by cart"
    },
    {
        "Name": "Whispering Trail",
        "Type": "Forest Path",
        "Length": 90,
        "Notes": "Narrow, winding road through dense forest. Known for strange sounds and occasional magical phenomena.",
        "TravelTime": "2 to 3 days by foot"
    },
    {
        "Name": "Sunblade Causeway",
        "Type": "Highway",
        "Length": 300,
        "Notes": "A major causeway leading into the Eastern Dominion. Used for military and ceremonial processions.",
        "TravelTime": "6 to 8 days by horse, 10 by cart"
    }
]