[
    {
        "Name": "Universal Curses",
        "Type": "Curses",
        "Text": "Half a brain and no spine. You’d lose a fight with your own shadow. Worm-hearted coward! May your tongue rot. Mud-sucking rat! Piss on your prayers! Soggy-brained bastard! You thick-skulled ox! Gods-damned fool!"
    },

    {
        "Name": "Blasphemous & Exclamatory Swearing",
        "Type": "Curses",
        "Text": "What the hell? For gods' sake! Gods’ mercy! God’s bloody hands! In the name of the heavens! May the gods strike me down! May the flames take you! Flame-damned liar! Praise be—what a mess. Saints preserve us. Divine light guide me—what is this? You’re void-touched! May Belon consume your soul!"
    },

    {
        "Name": "Arana",
        "Type": "Style of Speech",
        "Text": "Very thoughtful. Seldom blunt. Thinks first then speaks. Speech is too old for her age."
    },

    {
        "Name": "Liam",
        "Type": "Style of Speech",
        "Text": "Street talk, curses a lot. Rough speech, but you can tell he's smart—just uneducated."
    },

    {
        "Name": "Edric",
        "Type": "Style of Speech",
        "Text": "Posh and pompous. Speaks like the monarch he is. But he is bitter and dark."
    },

    {
        "Name": "Rhyn",
        "Type": "Style of Speech",
        "Text": "Devout and humble in his speech. sharp minded, but politically correct and cautious. deeploy devoted and faithful, but not unwavering if his compassion calls for it."
    },

    {
        "Name": "Sovalis",
        "Type": "Location Specific",
        "Text": "In Sovalis the speech is mixed—from high nobility to rough dockworkers, artists, clergy, and scribes. The style is comparable to 'Pillars of the Earth' time English."
    },

    {
        "Name": "High Arcanist Speech",
        "Type": "Profession Specific",
        "Text": "Formal and technical. Uses ancient magical terminology. Avoids contractions. Often speaks in layered metaphors and indirect phrasing."
    },

    {
        "Name": "Wild Magician",
        "Type": "Profession Specific",
        "Text": "Earthy and intuitive. Speaks plainly but with strange poetic metaphors. Occasionally slips into elemental references or animal comparisons."
    },

    {
        "Name": "Divine Priest",
        "Type": "Profession Specific",
        "Text": "Scriptural and reverent. Frequently quotes scripture or divine principles. Tends to speak in blessings, omens, and calls to prayer."
    },

    {
        "Name": "Healer",
        "Type": "Profession Specific",
        "Text": "Calm and nurturing. Uses a lot of bodily metaphors and comfort phrases. May adopt regional slang to ease patients."
    },

    {
        "Name": "Royal Guard",
        "Type": "Profession Specific",
        "Text": "Blunt, precise, and disciplined. Tends to keep sentences short. Prioritizes clarity and efficiency. Uses military terms naturally."
    },

    {
        "Name": "Scribe",
        "Type": "Profession Specific",
        "Text": "Verbose and articulate. Prefers written clarity over spoken brevity. Speaks as if constantly drafting a report."
    },

    {
        "Name": "Direct Insults",
        "Type": "Curses",
        "Text": "Choke on my fist, you sack of rat’s cum! May your cock shrivel and fall off. Shove your prayers up your own arse, preacher. You talk like a man with a shit-stuffed mouth. Hope you drown in your own fucking piss. You wouldn’t know a real fight if it split your skull open. Die screaming, you limp-dicked mule! Take your sermons and fuck yourself sideways. I’d rather fuck a corpse than listen to you another moment. Lick the shit off my boots, you godsdamned worm."
    },

    {
        "Name": "Filthy Swears",
        "Type": "Curses",
        "Text": "Rot and fester! Fuck me blind. Piss on this! Shit on your name! Gods' sagging fucking tits! Rotted balls of a dead king! May my arse rot before I deal with this shit. Drowned in piss and burning in shit!"
    },

    {
        "Name": "Brutal Insults",
        "Type": "Curses",
        "Text": "Your mother was fucked by a goat and you were the afterbirth. Your father should have drowned you in a bucket. You smell like a corpse fucked a midden heap. You're as useful as a broken cock on a wedding night. You fight like a sack of mashed guts. I’d say you were a dog’s ballsack, but that would be an insult to dogs. Your face makes me want to shit just looking at it. If brains were worth coin, you’d be begging in the gutters."
    },

    {
        "Name": "Sexual & Lewd Curses",
        "Type": "Curses",
        "Text": "Go fuck yourself with a sword pommel. You couldn’t get a wet cunt in a whore’s bathhouse. May your cock rot and fall off. Hope you get fucked by a demon with barbs. Lick the ass of a plague-ridden mule, you shit-stain. Your mother should have swallowed you."
    },

    {
        "Name": "Violent Threats",
        "Type": "Curses",
        "Text": "I’ll gut you and string your entrails like festival ribbons. If you don’t shut your hole, I’ll cut your fucking tongue out. I’ll cave your skull in and use it as a piss pot. Keep talking, and I’ll feed your balls to the dogs. I'll cut your heart out and feed it to your mother. May your bones shatter and your blood turn to piss."
    },

    {
        "Name": "Expressions of Absolute Rage",
        "Type": "Curses",
        "Text": "I’ll flay the fucking skin off your bones! If I see your face again, I’ll carve it off! I’d rather drink venom than look at you another moment! You worthless, slack-jawed fuck! By all the rotting gods, I’m going to rip your throat out!"
    },

    {
        "Name": "Rhetorical Rage Swears",
        "Type": "Curses",
        "Text": "Why in the gods’ rotting teeth. Why in the festering fuck. Why in the bleeding cock of Caelon. Why in the drowned cunt of Tana. Why in the seven shades of shit. Why in the name of Caelon’s blackened cock. Why in all the piss-soaked prayers of the faithful. Why in the name of every godsdamned blight on this cursed land. Why in the plague-ridden asshole of fate. Why in the blackened bowels of the gods."
    }
    ]



